STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MeshLightingProvisioner/STM32_WPAN/app/appli_nvm.c
/********************Embedded Provisioner *******************************/

/**
*  @brief  Find first valid subpage available. 
*          If no valid subpage found, erase page appli nvm to reset it
*  @param  pointer to variable to update first valid subpage index
*  @retval MOBLE_RESULT_SUCCESS on success
*/
MOBLE_RESULT AppliNvm_FindFirstEmptyPage(MOBLEINT16* subPageIndex,
                                         MOBLEUINT32 SubPageSize,
                                         MOBLEUINT32 totalSubPage, 
                                         MOBLEUINT32 nvmBaseOffset)
{
  MOBLEUINT32 valid[2];
  MOBLEINT8 subPageIdx = -1;
  MOBLEUINT32 *subPageOffset;
  MOBLEUINT32 addressValidPage;
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
  
  for (MOBLEUINT16 count=0; count<totalSubPage; count++)
  {
    addressValidPage = nvmBaseOffset + SubPageSize*count;
    subPageOffset = &addressValidPage;

    /* Read 8 bytes and check if it's Empty */
    memcpy((void*)&valid, (void*)(*subPageOffset), 8);

    if ((valid[0] == FLASH_EMPTY_SIGNATURE) /*&& (valid[1] == FLASH_EMPTY_SIGNATURE)*/)
    {
      subPageIdx = count;
      break;
    }
  }
  
  if (subPageIdx < 0)
  {
    TRACE_M(TF_PROVISION,"Out of Memory, Flash page is full \r\n");
    result = MOBLE_RESULT_OUTOFMEMORY;
  }
  else
  {
    result = MOBLE_RESULT_SUCCESS;
  }

  *subPageIndex = subPageIdx;
  
  return result;
}


/**
* @brief  Load Provisioner data from nvm
* @param  model state buff
* @param  model state buff size
* @retval MOBLE_RESULT_SUCCESS on success
*/
MOBLE_RESULT AppliPrvnNvm_LoadData(uint8_t state[], uint8_t* size)
{  
#if (SAVE_EMBD_PROVISION_DATA == 1)  
  
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
  
  memcpy((void*)state, (void*)(PrvnNvm_Reqs.prvnData), PRVN_NVM_CHUNK_SIZE);
  *size = PRVN_NVM_CHUNK_SIZE;
  
  return result;  
#else /* SAVE_EMBD_PROVISION_DATA */  
  *size = 0;
  return MOBLE_RESULT_SUCCESS;
#endif /* SAVE_EMBD_PROVISION_DATA */
}


/**
* @brief  Save Embedded provisioner data in nvm
* @param  devkey: data buffer to be saved
* @param  address: address of the Node to be saved
* @param  pUUID: pointer to the UUID
* @param  numElements: number of elements of the node
* @retval MOBLE_RESULT_SUCCESS on success
*/
MOBLE_RESULT AppliPrvnNvm_SaveData(uint8_t* devkey, 
                                   MOBLE_ADDRESS address,
                                   uint8_t* pUUID, 
                                   uint8_t numElements)
{
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS; /* if save model state not defined, return MOBLE_RESULT_FAIL */
  uint8_t *pNodeInfo;
  MOBLEUINT16 sizeTosave=0;
      
  pNodeInfo = PrvnNvm_Reqs.prvnData;

  /* Copy the Address and Number of Elements */
  memcpy(pNodeInfo, &address, 2);
  pNodeInfo += 2;
  memcpy(pNodeInfo, &numElements, 2); 
  
  pNodeInfo += 2;
  sizeTosave += 4;
  
  /* Copy the Device Key of the Node Primary address */
  memcpy(pNodeInfo, devkey, DEVICE_KEY_SIZE);
  pNodeInfo += DEVICE_KEY_SIZE;
  sizeTosave += DEVICE_KEY_SIZE;
  
#if ENABLE_SAVE_UUID_PER_NODE  
  /* Copy the UUID of the Node */
  memcpy(pNodeInfo, pUUID, UUID_SIZE);
  pNodeInfo += UUID_SIZE;
  sizeTosave += UUID_SIZE;
 #endif
      
 
  /*
    The 3-Element Node data saving will look like this ->

    0-1    2B Primary address 
    2,3    2B Element count
    4-19   DevKey for example 0x01, 0x02, ... 10
 
    20-21  2B  Primary address 
    22-23  2B  Element count
    24-39  16B DevKey for next address

    Advantage: We identify the Primary Node address
  */
    
  NodeUnderProvisionParam.newNodeAddress = address;
  NodeUnderProvisionParam.newNodeElements = numElements;
  PrvnNvm_Reqs.size = sizeTosave;
  
  return result;
}


/**
* @brief  Function to get the particular node device key with node address friom the 
*         provisioner flash.
* @param  MOBLE_ADDRESS: node address
* @retval subPageAddrss: pointer to the sub page address
*/
MOBLEUINT32* AppliPrvnNvm_GetNodeDevKey(MOBLE_ADDRESS addrss)
{
  MOBLEUINT16 subPageIndx;
  MOBLEUINT32 *subPageAddress;
  
  subPageIndx = addrss - FIRST_PRVND_NODE_ADDRSS;
    
  if(subPageIndx >= PRVN_NVM_MAX_SUBPAGE)
  {
    TRACE_M(TF_PROVISION,"Invalid Address \r\n");
    return 0;   
  }
  else
  {
    subPageAddress = (MOBLEUINT32 *)(PRVN_NVM_BASE_OFFSET + PRVN_NVM_SUBPAGE_OFFSET(subPageIndx));
    TRACE_M(TF_PROVISION,"Address Of SubPage =  %p \r\n", (void *)subPageAddress);
  }
  return subPageAddress;
}


/**
* @brief  backup by Copy all the data from the page in RAM.
* @param  model state buff
* @param  model state buff size
* @retval MOBLE_RESULT_SUCCESS on success
*/
MOBLE_RESULT AppliPrvnNvm_CopyData(uint8_t state[], uint8_t* size)
{
  
#if SAVE_EMBD_PROVISION_DATA    
  MOBLEUINT8 deviceKeysSaved[2048]; 
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
  
  /* find valid subpage */
    for (MOBLEUINT8 count=0; count<8; count++)
    {    
      memcpy((void*)deviceKeysSaved, (void*)(PRVN_NVM_BASE_OFFSET + PRVN_NVM_SUBPAGE_OFFSET(count)), PRVN_NVM_CHUNK_SIZE);
    }
    
  *size = PRVN_NVM_CHUNK_SIZE;
  
  return result;  
#else /* SAVE_EMBD_PROVISION_DATA */  
  *size = 0;
  return MOBLE_RESULT_SUCCESS;
#endif /* SAVE_EMBD_PROVISION_DATA */
    
}


/**
* @brief  Process Provisioner NVM erase and write requests
* @param  void
* @retval void
*/
void AppliPrvnNvm_Process(void)
{
  MOBLE_RESULT result;
  MOBLEINT16 subPageIdx;
  
  if ( (PrvnNvm_Reqs.erasePageReq == MOBLE_FALSE) && 
       (PrvnNvm_Reqs.writeReq == MOBLE_TRUE) )
  {
    result = AppliNvm_FindFirstEmptyPage(&subPageIdx,
                                         PRVN_NVM_CHUNK_SIZE,
                                         PRVN_NVM_MAX_SUBPAGE-1,
                                         PRVN_NVM_BASE_OFFSET);
    
    if(result == MOBLE_RESULT_OUTOFMEMORY)
    {
      PrvnNvm_Reqs.erasePageReq = MOBLE_TRUE;
      result = MOBLE_RESULT_FAIL;
    }
    else
    {
      TRACE_M(TF_PROVISION,"Saving in SubPage[%.8x] = \r\n", PRVN_NVM_SUBPAGE_OFFSET(subPageIdx));

      result = AppliPrvnNvm_FlashProgram(PRVN_NVM_SUBPAGE_OFFSET(subPageIdx), 
                                         PrvnNvm_Reqs.prvnData,
                                         PrvnNvm_Reqs.size);    
    
      if (result == MOBLE_RESULT_SUCCESS)
      {
        PrvnNvm_Reqs.writeReq = MOBLE_FALSE;
      }
    }
  }
}


/**
* @brief  This function is to save the provisioner device key in the flash.          
* @param  data:Pointer to the data passed.
* @param  size:size of the data
* @param  prvnFlag:Pointer to the flag passed.
* @retval void
*/
void AppliPrvnNvm_SaveProvisionerDevKey(MOBLEUINT8 *devkey , 
                                        MOBLE_ADDRESS address,
                                        MOBLEUINT8 *prvnFlag, 
                                        MOBLEUINT8 numOfElements)
{
  /* Note: Renamed the API from AppliNnm_saveProvisionerDevKey during refactoring */
  MOBLEUINT8 *pUUID = {0};
    
  if(*prvnFlag == 1)
  {
    AppliPrvnNvm_SaveData(&devkey[0], address, pUUID, numOfElements);
    SaveProvisionedNodeAddress();
    prvnFlag = 0;
    AppliPrvnNvm_SaveKeys(1);

