STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MeshLightingProvisioner/STM32_WPAN/app/appli_nvm.c
  }
}


/**
* @brief  This function is to save the keys in the flash
* @retval void
*/
void AppliPrvnNvm_SaveKeys (MOBLEUINT8 status)
{
  if (status == 1)
  {
    PrvnNvm_Reqs.writeReq = MOBLE_TRUE;  /* This will trigger the saving in flash */
  }
}


/**
* @brief  This function load the Provisioner nvm data to the buffer after reset.          
* @param  void
* @retval MOBLE_RESULT_SUCCESS on success
*/
MOBLE_RESULT AppliPrvnNvm_FactorySettingReset(MOBLEUINT8 *flag)
{
  MOBLEINT16 currSubPageIdx;
  MOBLE_RESULT result = MOBLE_RESULT_SUCCESS;
    
  /* Check which sub-page is empty */
  result = AppliNvm_FindFirstEmptyPage(&currSubPageIdx,
                                       PRVN_NVM_CHUNK_SIZE,
                                       (PRVN_NVM_MAX_SUBPAGE-1),
                                       PRVN_NVM_BASE_OFFSET);
  
  if(result == MOBLE_RESULT_OUTOFMEMORY)
  {
    result = MOBLE_RESULT_FAIL;
  }
  else
  {    
      /* After reset of provisioner , retreiving the next node address to be provisioned */
    if(currSubPageIdx == 0)
    {
      *flag = 1;
    }
      
    if(currSubPageIdx > 1)
    {
      NodeUnderProvisionParam.nodeAddress = currSubPageIdx;  
    }
    
      
    if(currSubPageIdx > 0)
    { /* If 1st page is empty, then decrementing by 1 will cause pointer to 
         wrong address */
      currSubPageIdx = currSubPageIdx-1;
     
      /* Load last Provisioner data saved from nvm */       
      memcpy((void*)PrvnNvm_Reqs.prvnData, 
             (void*)(PRVN_NVM_BASE_OFFSET + PRVN_NVM_SUBPAGE_OFFSET(currSubPageIdx)),
              PRVN_NVM_CHUNK_SIZE);    

      NodeUnderProvisionParam.nodeAddress = CopyU8LittleEndienArrayToU16word (&PrvnNvm_Reqs.prvnData[0]);  
      NodeUnderProvisionParam.numOfElements = PrvnNvm_Reqs.prvnData[2];  
     }
      
    TRACE_I(TF_PROVISION,"Next NVM Address %.8x \r\n",
            PRVN_NVM_BASE_OFFSET + PRVN_NVM_SUBPAGE_OFFSET(currSubPageIdx));
      
   }
     
  return result;
}

/**
* @}
*/

/**
* @}
*/
/******************* (C) COPYRIGHT 2017 STMicroelectronics *****END OF FILE****/
